src/DataProcessors/ИсправлениеРазмещения/ИсправлениеРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИсправлениеРазмещения</name>
</mdclass:DataProcessor>

src/Enums/Местоположения/Местоположения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Местоположения</name>
  <enumValues>
    <name>Дача</name>
  </enumValues>
  <enumValues>
    <name>Дом</name>
  </enumValues>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Ватутинки</name>
  </enumValues>
  <enumValues>
    <name>ЧеховМолодежная</name>
  </enumValues>
  <enumValues>
    <name>Корзина</name>
  </enumValues>
  <enumValues>
    <name>Перемещаемое</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>EnumRef.Местоположения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаЕстьСвободные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаКомпонент</name>
    <comment>это компонент компьютерной сборки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QR_Code</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ИсправлениеРазмещения/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыполнитьИсправлениеРазмещенияНаСервере()

	ГруппаАрхив = Справочники.Номенклатура.НайтиПоНаименованию("00 АРХИВ", Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Местоположение КАК Местоположение,
		|	Номенклатура.ВариантРазмещения КАК ВариантРазмещения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ВариантРазмещения = НоменклатураСервер.ПолучитьНомерРазмещения(Выборка.Ссылка);
		
		Если Выборка.ВариантРазмещения <> ВариантРазмещения Тогда
			Сообщить("Вариант размещения: " + Выборка.Ссылка +", "+ Выборка.ВариантРазмещения + ",  " + ВариантРазмещения);
		КонецЕсли;
		//ТекущийОбъект.ВариантРазмещения = ВариантРазмещения;

		МассивМест = НоменклатураСервер.ПолучитьРазмещения(Выборка.Ссылка);

		Если МассивМест.Количество() > 0 Тогда
			Местоположение = НоменклатураСервер.ПолучитьМестоположениеПоРазмещению(МассивМест);
		ИначеЕсли Выборка.Ссылка.ПринадлежитЭлементу(ГруппаАрхив) Тогда
			Местоположение = Перечисления.Местоположения.Архив;
		КонецЕсли;
		
		Если Выборка.ВариантРазмещения <> ВариантРазмещения Тогда
			Сообщить("Местоположение: " + Выборка.Ссылка +", "+ Выборка.Местоположение + ",  " + Местоположение);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИсправлениеРазмещения(Команда)
	ВыполнитьИсправлениеРазмещенияНаСервере();
КонецПроцедуры
